Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_adc.h
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL ADC Callback ID enumeration definition
  */
typedef enum
{
  HAL_ADC_CONVERSION_COMPLETE_CB_ID     = 0x00U,  /*!< ADC conversion complete callback ID */
  HAL_ADC_CONVERSION_HALFBLOCK_CB_ID    = 0x01U,  /*!< ADC conversion DMA halfblock-transfer callback ID */
  HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID   = 0x02U,  /*!< ADC analog watchdog 1 callback ID */
  HAL_ADC_ERROR_CB_ID                   = 0x03U,  /*!< ADC error callback ID */
  HAL_ADC_INJ_CONVERSION_COMPLETE_CB_ID = 0x04U,  /*!< ADC group injected conversion complete callback ID */
  HAL_ADC_LEVEL_OUT_OF_WINDOW_2_CB_ID   = 0x05U,  /*!< ADC analog watchdog 2 callback ID */
  HAL_ADC_LEVEL_OUT_OF_WINDOW_3_CB_ID   = 0x06U,  /*!< ADC analog watchdog 3 callback ID */
  HAL_ADC_END_OF_SAMPLING_CB_ID         = 0x07U,  /*!< ADC end of sampling callback ID */
  HAL_ADC_MSPINIT_CB_ID                 = 0x08U,  /*!< ADC Msp Init callback ID          */
  HAL_ADC_MSPDEINIT_CB_ID               = 0x09U   /*!< ADC Msp DeInit callback ID        */
} HAL_ADC_CallbackIDTypeDef;

/**
  * @brief  HAL ADC Callback pointer definition
  */
typedef  void (*pADC_CallbackTypeDef)(ADC_HandleTypeDef *hadc); /*!< pointer to a ADC callback function */

#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */

/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup ADC_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */
#define HAL_ADC_ERROR_NONE              (0x00U)   /*!< No error                                    */
#define HAL_ADC_ERROR_INTERNAL          (0x01U)   /*!< ADC peripheral internal error (problem of clocking,
                                                       enable/disable, erroneous state, ...)       */
#define HAL_ADC_ERROR_DMA               (0x02U)   /*!< DMA transfer error                          */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U)   /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define ADC_RESOLUTION_12B                 (LL_ADC_RESOLUTION_12B)  /*!< ADC resolution 12 bits */
#define ADC_RESOLUTION_10B                 (LL_ADC_RESOLUTION_10B)  /*!< ADC resolution 10 bits */
#define ADC_RESOLUTION_8B                  (LL_ADC_RESOLUTION_8B)   /*!< ADC resolution  8 bits */
#define ADC_RESOLUTION_6B                  (LL_ADC_RESOLUTION_6B)   /*!< ADC resolution  6 bits */
/**
  * @}
  */

/** @defgroup ADC_VrefBuf ADC VrefBuf
  * @{
  */  
#define ADC_VREFBUF_VCCA                   (0x00000000U)                                           /*!< VREFBUF VCCA   */
#define ADC_VREFBUF_2P048V                 ((uint32_t)(ADC_CCR_VREFSEL | ADC_CCR_VREFBUFEN))                           /*!< VREFBUF 2.048V */
#define ADC_VREFBUF_2P5V                   ((uint32_t)(ADC_CCR_VREFSEL | ADC_CCR_VREFBUFEN | ADC_CCR_VREFBUFSEL_0))    /*!< VREFBUF 2.5V   */
#define ADC_VREFBUF_2P9V                   ((uint32_t)(ADC_CCR_VREFSEL | ADC_CCR_VREFBUFEN | ADC_CCR_VREFBUFSEL_1))    /*!< VREFBUF 2.9V   */
#define ADC_VREFBUF_1P08V                  ((uint32_t)(ADC_CCR_VREFSEL | ADC_CCR_VREFBUFEN | ADC_CCR_VREFBUFSEL  ))    /*!< VREFBUF 1.08V  */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_DATA_ALIGN ADC conversion data alignment
  * @{
  */
#define ADC_DATAALIGN_RIGHT                (LL_ADC_DATA_ALIGN_RIGHT) /*!< ADC conversion data alignment: right aligned
                                           (alignment on data register LSB bit 0)*/
#define ADC_DATAALIGN_LEFT                 (LL_ADC_DATA_ALIGN_LEFT)  /*!< ADC conversion data alignment: left aligned
                                           (alignment on data register MSB bit 15)*/
/**
  * @}
  */

/** @defgroup ADC_Scan_mode ADC sequencer scan mode
  * @{
  */
#define ADC_SCAN_DISABLE          0x00000000U     /*!< ADC conversion is performed in unitary conversion mode (one 
                                                  channel converted, that defined in rank 1). Configuration of both
                                                  groups regular and injected sequencers (sequence length, ...) is 
                                                  discarded: equivalent to length of 1 rank.*/
#define ADC_SCAN_ENABLE           (ADC_CFGR_SCAN) /*!< ADC conversions are performed in sequence conversions mode, 
                                                  according to configuration of both groups regular and injected 
                                                  sequencers (sequence length, ...). */
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_source ADC group regular trigger source
  * @{
  */
#define ADC_SOFTWARE_START               (LL_ADC_REG_TRIG_SOFTWARE        )
#define ADC_EXTERNALTRIG_T1_CC1          (LL_ADC_REG_TRIG_EXT_TIM1_CH1    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T1_CC2          (LL_ADC_REG_TRIG_EXT_TIM1_CH2    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T1_CC3          (LL_ADC_REG_TRIG_EXT_TIM1_CH3    )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T2_CC2          (LL_ADC_REG_TRIG_EXT_TIM2_CH2    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T3_TRGO         (LL_ADC_REG_TRIG_EXT_TIM3_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T4_CC4          (LL_ADC_REG_TRIG_EXT_TIM4_CH4    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_EXT_IT11        (LL_ADC_REG_TRIG_EXT_EXTI_LINE11 )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T8_TRGO         (LL_ADC_REG_TRIG_EXT_TIM8_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T8_TRGO2        (LL_ADC_REG_TRIG_EXT_TIM8_TRGO2  )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T1_TRGO         (LL_ADC_REG_TRIG_EXT_TIM1_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T1_TRGO2        (LL_ADC_REG_TRIG_EXT_TIM1_TRGO2  )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T2_TRGO         (LL_ADC_REG_TRIG_EXT_TIM2_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T4_TRGO         (LL_ADC_REG_TRIG_EXT_TIM4_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T6_TRGO         (LL_ADC_REG_TRIG_EXT_TIM6_TRGO   )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T15_TRGO        (LL_ADC_REG_TRIG_EXT_TIM15_TRGO  )  /*Note: This trigger is available only on ADC1/2/3 instances */
#define ADC_EXTERNALTRIG_T3_CC4          (LL_ADC_REG_TRIG_EXT_TIM3_CH4    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T9_CC1          (LL_ADC_REG_TRIG_EXT_TIM9_CH1    )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T10_CC1         (LL_ADC_REG_TRIG_EXT_TIM10_CH1   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T11_CC1         (LL_ADC_REG_TRIG_EXT_TIM11_CH1   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T12_CC1         (LL_ADC_REG_TRIG_EXT_TIM12_CH1   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T18_TRGO        (LL_ADC_REG_TRIG_EXT_TIM18_TRGO  )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T18_CC2         (LL_ADC_REG_TRIG_EXT_TIM18_CH2   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T19_CC1         (LL_ADC_REG_TRIG_EXT_TIM19_CH1   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_T7_TRGO         (LL_ADC_REG_TRIG_EXT_TIM7_TRGO   )  /*Note: This trigger is available only on ADC1/2 instances */
#define ADC_EXTERNALTRIG_LPTIM_OUT       (LL_ADC_REG_TRIG_EXT_LPTIM_OUT   )  /*Note: This trigger is available only on ADC1/2 instances */

/*Note: On this series, following trigger is available only on ADC3 instances.*/
#define ADC_EXTERNALTRIG_T3_CC1          (LL_ADC_REG_TRIG_EXT_TIM3_CH1       )
#define ADC_EXTERNALTRIG_T2_CC3          (LL_ADC_REG_TRIG_EXT_TIM2_CH3       )
#define ADC_EXTERNALTRIG_T8_CC1          (LL_ADC_REG_TRIG_EXT_TIM8_CH1       )
#define ADC_EXTERNALTRIG_EXT_IT2         (LL_ADC_REG_TRIG_EXT_EXTI_LINE2     )
#define ADC_EXTERNALTRIG_T4_CC1          (LL_ADC_REG_TRIG_EXT_TIM4_CH1       )
#define ADC_EXTERNALTRIG_T2_CC1          (LL_ADC_REG_TRIG_EXT_TIM2_CH1       )
#define ADC_EXTERNALTRIG_T18_CC3         (LL_ADC_REG_TRIG_EXT_TIM18_CH3      )
#define ADC_EXTERNALTRIG_T18_TRGO_ADC3   (LL_ADC_REG_TRIG_EXT_TIM18_TRGO_ADC3)
#define ADC_EXTERNALTRIG_T18_CC1         (LL_ADC_REG_TRIG_EXT_TIM18_CH1      )
#define ADC_EXTERNALTRIG_T10_CC1_ADC3    (LL_ADC_REG_TRIG_EXT_TIM10_CH1_ADC3 )
#define ADC_EXTERNALTRIG_T13_CC1         (LL_ADC_REG_TRIG_EXT_TIM13_CH1      )
#define ADC_EXTERNALTRIG_T18_CC1_ADC3    (LL_ADC_REG_TRIG_EXT_TIM18_CH1_ADC3 )
#define ADC_EXTERNALTRIG_T7_TRGO_ADC3    (LL_ADC_REG_TRIG_EXT_TIM7_TRGO_ADC3 )
#define ADC_EXTERNALTRIG_LPTIM_OUT_ADC3  (LL_ADC_REG_TRIG_EXT_LPTIM_OUT_ADC3 )
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_edge ADC group regular trigger edge (when external trigger is selected)
  * @{
  */
#define ADC_EXTERNALTRIGCONVEDGE_NONE           (0x00000000UL)                      /*!< ADC group regular trigger
                                                disabled (SW start)*/
#define ADC_EXTERNALTRIGCONVEDGE_RISING         (LL_ADC_REG_TRIG_EXT_RISING)        /*!< ADC group regular conversion
                                                trigger polarity set to rising edge */
#define ADC_EXTERNALTRIGCONVEDGE_FALLING        (LL_ADC_REG_TRIG_EXT_FALLING)       /*!< ADC group regular conversion
                                                trigger polarity set to falling edge */
#define ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING  (LL_ADC_REG_TRIG_EXT_RISINGFALLING) /*!< ADC group regular conversion
                                                trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_EOCSelection ADC sequencer end of unitary conversion or sequence conversions
  * @{
  */
#define ADC_EOC_SINGLE_CONV         (ADC_ISR_EOC)                 /*!< End of unitary conversion flag  */
#define ADC_EOC_SEQ_CONV            (ADC_ISR_EOS)                 /*!< End of sequence conversions flag    */
/**
  * @}
  */

